{
  "backend/main.mo": "Empty Motoko actor with no logic.",
  "feature_evidence.json": "Lists feature evidence mapping features to files, components, test IDs, and confidence.",
  "frontend-file-summaries.txt": "Provides short descriptions of various frontend components, hooks, and styles for build reference.",
  "frontend/index.css": "Tailwind base/style definitions with extensive CSS variables for light/dark themes and global styling.",
  "frontend/index.html": "HTML entry point loading fonts and mounting the React app root.",
  "frontend/src/App.tsx": "Main React app orchestrating UI, proposal state, sounds, evasive NO behavior, and celebration flow.",
  "frontend/src/components/celebration/CelebrationLayer.tsx": "Full‑screen celebration overlay with darkened background, confetti, and emoji burst.",
  "frontend/src/components/celebration/EmojiBurst.tsx": "Generates radial burst of floating emojis with randomized angles and delays.",
  "frontend/src/components/celebration/HeartConfetti.tsx": "Creates falling heart confetti pieces with random positions, delays, sizes, and durations.",
  "frontend/src/components/celebration/ModalAccents.tsx": "Adds sparkles and floating heart outlines as decorative modal accents.",
  "frontend/src/components/celebration/ProposalYesModal.tsx": "Timed celebration modal displaying themed visuals and text after YES is clicked.",
  "frontend/src/components/proposal/EvasiveNoButton.tsx": "NO button with evasive movement, non-focusability, and interaction handlers preventing activation.",
  "frontend/src/components/proposal/YesButton.tsx": "Styled YES button triggering acceptance and celebration actions.",
  "frontend/src/components/romance/BeatingHeart.tsx": "Animated beating heart emoji with responsive sizing.",
  "frontend/src/components/romance/EmojiReactionsTrail.tsx": "Generates floating emoji trails based on pointer movement with throttled spawn rate.",
  "frontend/src/components/romance/HeartbeatShell.tsx": "Wraps children in a div that applies a heartbeat pulse animation.",
  "frontend/src/components/romance/HeartParticlesCanvas.tsx": "Renders an animated canvas of drifting heart particles, with dense mode biasing hearts toward the bottom. Handles resizing, drawing, movement, and cleanup.",
  "frontend/src/components/romance/MusicToggle.tsx": "Button that toggles background music playback using useBackgroundMusic, showing play/pause icons.",
  "frontend/src/components/romance/RomanticBackground.tsx": "Provides a fixed layered romantic gradient background with bokeh effects and subtle glow.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor based on Internet Identity, invalidating related queries when identity changes.",
  "frontend/src/hooks/useBackgroundMusic.ts": "Manages a looping background audio element and provides a toggle to play or pause it.",
  "frontend/src/hooks/useEvasiveNo.ts": "Controls a moving 'No' button that relocates, shrinks, and cycles phrases based on user interaction and timed movement.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, loading stored identities and exposing login, logout, and status.",
  "frontend/src/hooks/useNavigationGuard.ts": "Adds a beforeunload warning when shouldWarn is true to prevent accidental navigation away.",
  "frontend/src/hooks/useProposalState.ts": "Tracks proposal state in localStorage and exposes helpers to switch between idle, celebrating, and completed.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file indicating no backend queries are needed.",
  "frontend/src/hooks/useSoundEffects.ts": "Initializes and plays click and explosion UI sound effects with simple playback helpers.",
  "frontend/src/index.css": "Tailwind setup defining romantic-themed color variables, gradients, shadows, and responsive scaling.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider, then renders App.",
  "frontend/tailwind.config.js": "Tailwind CSS config enabling dark mode, custom color variables, extended themes, animations, and plugins like typography and container queries.",
  "project_state.json": "Project state file describing the Valentine proposal app’s features, architecture notes, existing feature versions, and pending feature requests."
}